ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32660/Libraries/PeriphDrivers/Source/GPIO/gpio_reva_regs.h
/**@} end of group GPIO_REVA_EN1_SET_Register */

/**
 * @ingroup  gpio_reva_registers
 * @defgroup GPIO_REVA_EN1_CLR GPIO_REVA_EN1_CLR
 * @brief    GPIO Alternate Function Clear. Writing a 1 to one or more bits in this register
 *           clears the bits in the same positions in GPIO_EN1 to 0, without affecting other
 *           bits in that register.
 * @{
 */
#define MXC_F_GPIO_REVA_EN1_CLR_ALL_POS                0 /**< EN1_CLR_ALL Position */
#define MXC_F_GPIO_REVA_EN1_CLR_ALL                    ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_REVA_EN1_CLR_ALL_POS)) /**< EN1_CLR_ALL Mask */

/**@} end of group GPIO_REVA_EN1_CLR_Register */

/**
 * @ingroup  gpio_reva_registers
 * @defgroup GPIO_REVA_EN2 GPIO_REVA_EN2
 * @brief    GPIO Alternate Function Enable Register. Each bit in this register selects
 *           between primary/secondary functions for the associated GPIO pin in this port.
 * @{
 */
#define MXC_F_GPIO_REVA_EN2_GPIO_EN2_POS               0 /**< EN2_GPIO_EN2 Position */
#define MXC_F_GPIO_REVA_EN2_GPIO_EN2                   ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_REVA_EN2_GPIO_EN2_POS)) /**< EN2_GPIO_EN2 Mask */
#define MXC_V_GPIO_REVA_EN2_GPIO_EN2_PRIMARY           ((uint32_t)0x0UL) /**< EN2_GPIO_EN2_PRIMARY Value */
#define MXC_S_GPIO_REVA_EN2_GPIO_EN2_PRIMARY           (MXC_V_GPIO_REVA_EN2_GPIO_EN2_PRIMARY << MXC_F_GPIO_REVA_EN2_GPIO_EN2_POS) /**< EN2_GPIO_EN2_PRIMARY Setting */
#define MXC_V_GPIO_REVA_EN2_GPIO_EN2_SECONDARY         ((uint32_t)0x1UL) /**< EN2_GPIO_EN2_SECONDARY Value */
#define MXC_S_GPIO_REVA_EN2_GPIO_EN2_SECONDARY         (MXC_V_GPIO_REVA_EN2_GPIO_EN2_SECONDARY << MXC_F_GPIO_REVA_EN2_GPIO_EN2_POS) /**< EN2_GPIO_EN2_SECONDARY Setting */

/**@} end of group GPIO_REVA_EN2_Register */

/**
 * @ingroup  gpio_reva_registers
 * @defgroup GPIO_REVA_EN2_SET GPIO_REVA_EN2_SET
 * @brief    GPIO Alternate Function 2 Set. Writing a 1 to one or more bits in this register
 *           sets the bits in the same positions in GPIO_EN2 to 1, without affecting other
 *           bits in that register.
 * @{
 */
#define MXC_F_GPIO_REVA_EN2_SET_ALL_POS                0 /**< EN2_SET_ALL Position */
#define MXC_F_GPIO_REVA_EN2_SET_ALL                    ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_REVA_EN2_SET_ALL_POS)) /**< EN2_SET_ALL Mask */

/**@} end of group GPIO_REVA_EN2_SET_Register */

/**
 * @ingroup  gpio_reva_registers
 * @defgroup GPIO_REVA_EN2_CLR GPIO_REVA_EN2_CLR
 * @brief    GPIO Wake Alternate Function Clear. Writing a 1 to one or more bits in this
 *           register clears the bits in the same positions in GPIO_EN2 to 0, without
 *           affecting other bits in that register.
 * @{
 */
#define MXC_F_GPIO_REVA_EN2_CLR_ALL_POS                0 /**< EN2_CLR_ALL Position */
#define MXC_F_GPIO_REVA_EN2_CLR_ALL                    ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_REVA_EN2_CLR_ALL_POS)) /**< EN2_CLR_ALL Mask */

/**@} end of group GPIO_REVA_EN2_CLR_Register */

/**
 * @ingroup  gpio_reva_registers
 * @defgroup GPIO_REVA_EN3 GPIO_REVA_EN3
 * @brief    GPIO Alternate Function Enable Register. Each bit in this register selects
 *           between primary/secondary functions for the associated GPIO pin in this port.
 * @{
 */
#define MXC_F_GPIO_REVA_EN3_GPIO_EN3_POS               0 /**< EN3_GPIO_EN3 Position */
#define MXC_F_GPIO_REVA_EN3_GPIO_EN3                   ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_REVA_EN3_GPIO_EN3_POS)) /**< EN3_GPIO_EN3 Mask */
#define MXC_V_GPIO_REVA_EN3_GPIO_EN3_PRIMARY           ((uint32_t)0x0UL) /**< EN3_GPIO_EN3_PRIMARY Value */
#define MXC_S_GPIO_REVA_EN3_GPIO_EN3_PRIMARY           (MXC_V_GPIO_REVA_EN3_GPIO_EN3_PRIMARY << MXC_F_GPIO_REVA_EN3_GPIO_EN3_POS) /**< EN3_GPIO_EN3_PRIMARY Setting */
#define MXC_V_GPIO_REVA_EN3_GPIO_EN3_SECONDARY         ((uint32_t)0x1UL) /**< EN3_GPIO_EN3_SECONDARY Value */
#define MXC_S_GPIO_REVA_EN3_GPIO_EN3_SECONDARY         (MXC_V_GPIO_REVA_EN3_GPIO_EN3_SECONDARY << MXC_F_GPIO_REVA_EN3_GPIO_EN3_POS) /**< EN3_GPIO_EN3_SECONDARY Setting */

/**@} end of group GPIO_REVA_EN3_Register */

/**
 * @ingroup  gpio_reva_registers
 * @defgroup GPIO_REVA_EN3_SET GPIO_REVA_EN3_SET
 * @brief    GPIO Alternate Function 3 Set. Writing a 1 to one or more bits in this register
 *           sets the bits in the same positions in GPIO_EN3 to 1, without affecting other
 *           bits in that register.
 * @{
 */
#define MXC_F_GPIO_REVA_EN3_SET_ALL_POS                0 /**< EN3_SET_ALL Position */
#define MXC_F_GPIO_REVA_EN3_SET_ALL                    ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_REVA_EN3_SET_ALL_POS)) /**< EN3_SET_ALL Mask */

/**@} end of group GPIO_REVA_EN3_SET_Register */

/**
 * @ingroup  gpio_reva_registers
 * @defgroup GPIO_REVA_EN3_CLR GPIO_REVA_EN3_CLR
 * @brief    GPIO Wake Alternate Function Clear. Writing a 1 to one or more bits in this
 *           register clears the bits in the same positions in GPIO_EN3 to 0, without
 *           affecting other bits in that register.
 * @{
 */
#define MXC_F_GPIO_REVA_EN3_CLR_ALL_POS                0 /**< EN3_CLR_ALL Position */
#define MXC_F_GPIO_REVA_EN3_CLR_ALL                    ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_REVA_EN3_CLR_ALL_POS)) /**< EN3_CLR_ALL Mask */

/**@} end of group GPIO_REVA_EN3_CLR_Register */

/**
 * @ingroup  gpio_reva_registers
 * @defgroup GPIO_REVA_HYSEN GPIO_REVA_HYSEN
 * @brief    GPIO Input Hysteresis Enable.
 * @{
 */
#define MXC_F_GPIO_REVA_HYSEN_GPIO_HYSEN_POS           0 /**< HYSEN_GPIO_HYSEN Position */
#define MXC_F_GPIO_REVA_HYSEN_GPIO_HYSEN               ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_REVA_HYSEN_GPIO_HYSEN_POS)) /**< HYSEN_GPIO_HYSEN Mask */

/**@} end of group GPIO_REVA_HYSEN_Register */

/**
 * @ingroup  gpio_reva_registers
 * @defgroup GPIO_REVA_SRSEL GPIO_REVA_SRSEL
 * @brief    GPIO Slew Rate Enable Register.
 * @{
 */
#define MXC_F_GPIO_REVA_SRSEL_GPIO_SRSEL_POS           0 /**< SRSEL_GPIO_SRSEL Position */
#define MXC_F_GPIO_REVA_SRSEL_GPIO_SRSEL               ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_REVA_SRSEL_GPIO_SRSEL_POS)) /**< SRSEL_GPIO_SRSEL Mask */
#define MXC_V_GPIO_REVA_SRSEL_GPIO_SRSEL_FAST          ((uint32_t)0x0UL) /**< SRSEL_GPIO_SRSEL_FAST Value */
#define MXC_S_GPIO_REVA_SRSEL_GPIO_SRSEL_FAST          (MXC_V_GPIO_REVA_SRSEL_GPIO_SRSEL_FAST << MXC_F_GPIO_REVA_SRSEL_GPIO_SRSEL_POS) /**< SRSEL_GPIO_SRSEL_FAST Setting */
#define MXC_V_GPIO_REVA_SRSEL_GPIO_SRSEL_SLOW          ((uint32_t)0x1UL) /**< SRSEL_GPIO_SRSEL_SLOW Value */
#define MXC_S_GPIO_REVA_SRSEL_GPIO_SRSEL_SLOW          (MXC_V_GPIO_REVA_SRSEL_GPIO_SRSEL_SLOW << MXC_F_GPIO_REVA_SRSEL_GPIO_SRSEL_POS) /**< SRSEL_GPIO_SRSEL_SLOW Setting */

/**@} end of group GPIO_REVA_SRSEL_Register */

/**
 * @ingroup  gpio_reva_registers
 * @defgroup GPIO_REVA_DS0 GPIO_REVA_DS0
 * @brief    GPIO Drive Strength  Register. Each bit in this register selects the drive
 *           strength for the associated GPIO pin in this port. Refer to the Datasheet for
 *           sink/source current of GPIO pins in each mode.
 * @{
 */
#define MXC_F_GPIO_REVA_DS0_GPIO_DS0_POS               0 /**< DS0_GPIO_DS0 Position */
#define MXC_F_GPIO_REVA_DS0_GPIO_DS0                   ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_REVA_DS0_GPIO_DS0_POS)) /**< DS0_GPIO_DS0 Mask */
#define MXC_V_GPIO_REVA_DS0_GPIO_DS0_LD                ((uint32_t)0x0UL) /**< DS0_GPIO_DS0_LD Value */
#define MXC_S_GPIO_REVA_DS0_GPIO_DS0_LD                (MXC_V_GPIO_REVA_DS0_GPIO_DS0_LD << MXC_F_GPIO_REVA_DS0_GPIO_DS0_POS) /**< DS0_GPIO_DS0_LD Setting */
#define MXC_V_GPIO_REVA_DS0_GPIO_DS0_HD                ((uint32_t)0x1UL) /**< DS0_GPIO_DS0_HD Value */
#define MXC_S_GPIO_REVA_DS0_GPIO_DS0_HD                (MXC_V_GPIO_REVA_DS0_GPIO_DS0_HD << MXC_F_GPIO_REVA_DS0_GPIO_DS0_POS) /**< DS0_GPIO_DS0_HD Setting */

/**@} end of group GPIO_REVA_DS0_Register */

/**
 * @ingroup  gpio_reva_registers
 * @defgroup GPIO_REVA_DS1 GPIO_REVA_DS1
 * @brief    GPIO Drive Strength 1 Register. Each bit in this register selects the drive
 *           strength for the associated GPIO pin in this port. Refer to the Datasheet for
 *           sink/source current of GPIO pins in each mode.
 * @{
 */
#define MXC_F_GPIO_REVA_DS1_GPIO_DS1_POS               0 /**< DS1_GPIO_DS1 Position */
#define MXC_F_GPIO_REVA_DS1_GPIO_DS1                   ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_REVA_DS1_GPIO_DS1_POS)) /**< DS1_GPIO_DS1 Mask */

/**@} end of group GPIO_REVA_DS1_Register */

/**
 * @ingroup  gpio_reva_registers
 * @defgroup GPIO_REVA_PS GPIO_REVA_PS
 * @brief    GPIO Pull Select Mode.
 * @{
 */
#define MXC_F_GPIO_REVA_PS_ALL_POS                     0 /**< PS_ALL Position */
#define MXC_F_GPIO_REVA_PS_ALL                         ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_REVA_PS_ALL_POS)) /**< PS_ALL Mask */

/**@} end of group GPIO_REVA_PS_Register */

/**
 * @ingroup  gpio_reva_registers
 * @defgroup GPIO_REVA_VSSEL GPIO_REVA_VSSEL
 * @brief    GPIO Voltage Select.
 * @{
 */
#define MXC_F_GPIO_REVA_VSSEL_ALL_POS                  0 /**< VSSEL_ALL Position */
#define MXC_F_GPIO_REVA_VSSEL_ALL                      ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_REVA_VSSEL_ALL_POS)) /**< VSSEL_ALL Mask */

/**@} end of group GPIO_REVA_VSSEL_Register */

#ifdef __cplusplus
}
#endif

#endif  // LIBRARIES_PERIPHDRIVERS_SOURCE_GPIO_GPIO_REVA_REGS_H_

